{
    "vagas": [
        {
            "id": 1,
            "titulo": "Desenvolvedor Web",
            "local": "São Paulo",
            "requisitos": "Experiência em JavaScript, React e integração com APIs REST",
            "salario": "R$ 4.000,00",
            "descricao": "Buscamos um desenvolvedor web para atuar na manutenção e evolução de nossa plataforma. É necessário ter domínio de JavaScript moderno, frameworks como React, e familiaridade com Git. Diferencial: experiência com acessibilidade e design responsivo.",
            "empresaId": 1,
            "dataCadastro": "2025-05-25T09:30:00Z"
        },
        {
            "id": 2,
            "titulo": "Assistente Administrativo",
            "local": "Belo Horizonte",
            "requisitos": "Experiência com processos administrativos e pacote Office",
            "salario": "R$ 2.500,00",
            "descricao": "Profissional responsável por rotinas administrativas, como controle de documentos, atendimento a fornecedores e organização de agendas. Espera-se proatividade e boa comunicação escrita e verbal.",
            "empresaId": 3,
            "dataCadastro": "2025-05-24T14:15:00Z"
        },
        {
            "id": 3,
            "titulo": "Operador de Logística",
            "local": "Curitiba",
            "requisitos": "Ensino médio completo e experiência com estoque",
            "salario": "R$ 2.200,00",
            "descricao": "Atuar no setor de logística com recebimento, conferência e organização de mercadorias. Necessário conhecimento básico em sistemas de estoque e disponibilidade para trabalho em turnos.",
            "empresaId": 3,
            "dataCadastro": "2025-05-22T08:00:00Z"
        },
        {
            "id": 4,
            "titulo": "Auxiliar de Cozinha",
            "local": "Rio de Janeiro",
            "requisitos": "Experiência em cozinha profissional e manipulação de alimentos",
            "salario": "R$ 1.800,00",
            "descricao": "Auxiliar na preparação de pratos, organização da cozinha e controle de insumos. Desejável conhecimento em boas práticas de higiene e segurança alimentar.",
            "empresaId": 2,
            "dataCadastro": "2025-05-23T12:45:00Z"
        },
        {
            "id": 5,
            "titulo": "Técnico de Enfermagem",
            "local": "Porto Alegre",
            "requisitos": "Curso técnico completo, registro no conselho e experiência em atendimentos básicos de saúde",
            "salario": "R$ 3.200,00",
            "descricao": "Profissional para atuar em clínicas populares, com foco em atendimento humanizado e integração com projetos sociais.",
            "empresaId": 4,
            "dataCadastro": "2025-05-24T16:30:00Z"
        },
        {
            "id": 6,
            "titulo": "Analista de Sistemas",
            "local": "São Paulo",
            "requisitos": "Formação em TI, conhecimento em bancos de dados e integração de sistemas",
            "salario": "R$ 5.000,00",
            "descricao": "Atuar no desenvolvimento e manutenção de sistemas internos, participando da arquitetura de soluções digitais inovadoras.",
            "empresaId": 1,
            "dataCadastro": "2025-05-25T10:00:00Z"
        }
    ],
    "empresas": [
        {
            "id": 1,
            "nome": "TechBrasil Inovação",
            "setor": "Tecnologia da Informação",
            "localizacao": "São Paulo, SP",
            "compromisso": "Programa de mentoria e integração para talentos migrantes",
            "descricao": "Empresa especializada em soluções digitais, a TechBrasil conta com um programa de capacitação de migrantes em áreas de desenvolvimento e tecnologia, promovendo inclusão e diversidade no ambiente corporativo.",
            "logo": "../../imagens/logos/techbrasil.png",
            "site": "https://www.techbrasilinovacao.com.br"
        },
        {
            "id": 2,
            "nome": "Sabores Brasileiros Ltda.",
            "setor": "Gastronomia e Alimentação",
            "localizacao": "Rio de Janeiro, RJ",
            "compromisso": "Priorização da contratação de refugiados com experiência culinária",
            "descricao": "Rede de restaurantes que valoriza a diversidade cultural e promove a inclusão por meio da gastronomia. Possui unidades que celebram pratos típicos de diversas regiões do mundo, empregando talentos migrantes em sua cozinha.",
            "logo": "../../imagens/logos/saboresbrasileiros.png",
            "site": "https://www.saboresbrasileiros.com"
        },
        {
            "id": 3,
            "nome": "Construmundo Engenharia",
            "setor": "Construção Civil",
            "localizacao": "Fortaleza, CE",
            "compromisso": "Programa de capacitação e contratação de refugiados",
            "descricao": "A Construmundo oferece cursos técnicos gratuitos para refugiados e migrantes, visando capacitá-los para atuar na construção civil com segurança e qualificação, com foco na integração ao mercado formal.",
            "logo": "../../imagens/logos/construmundo.png",
            "site": "https://www.construmundoengenharia.com"
        },
        {
            "id": 4,
            "nome": "Saúde Viva Cooperativa",
            "setor": "Saúde e Bem-estar",
            "localizacao": "Porto Alegre, RS",
            "compromisso": "Inclusão de profissionais migrantes nas áreas de atendimento e suporte",
            "descricao": "Cooperativa voltada à saúde preventiva, que integra migrantes com formação na área da saúde, oferecendo revalidação de diplomas e oportunidades em clínicas populares e projetos comunitários.",
            "logo": "../../imagens/logos/saudeviva.png",
            "site": "https://www.saudeviva.coop.br"
        }
    ],
    "recursos": [
        {
            "id": 1,
            "titulo": "Guia de Elaboração de Currículo",
            "descricao": "Dicas e modelos para criar um currículo eficaz e destacar suas habilidades. Inclui exemplos específicos para diferentes áreas e orientações sobre o que evitar.",
            "link": "tela_recursos.html",
            "textoBotao": "Ler Guia"
        },
        {
            "id": 2,
            "titulo": "Preparação para Entrevistas de Emprego",
            "descricao": "Conselhos práticos para se preparar e ter sucesso nas entrevistas. Aborda tipos de perguntas, postura, como lidar com o nervosismo e como destacar sua história.",
            "link": "tela_recursos.html",
            "textoBotao": "Ver Dicas"
        },
        {
            "id": 3,
            "titulo": "Documentação para Contratação",
            "descricao": "Lista dos principais documentos exigidos na hora da contratação, com explicações para migrantes e orientações sobre como regularizar sua situação.",
            "link": "tela_recursos.html",
            "textoBotao": "Consultar"
        },
        {
            "id": 4,
            "titulo": "Cursos Gratuitos de Qualificação",
            "descricao": "Links para plataformas de cursos online gratuitos com foco em empregabilidade, português como segunda língua, tecnologia, serviços e atendimento ao público.",
            "link": "tela_recursos.html",
            "textoBotao": "Acessar Cursos"
        }
    ],
    "ongs": [
        {
            "id": 1,
            "nome": "Refúgio Solidário",
            "localizacao": "São Paulo, SP",
            "servicos": "Apoio jurídico, orientação para regularização documental, cursos de capacitação profissional",
            "contato": "contato@refugiosolidario.org",
            "descricao": "Organização que oferece suporte integral a refugiados, incluindo assistência jurídica e programas de inserção no mercado de trabalho.",
            "setor": "Direitos Humanos e Assistência Social",
            "compromisso": "Promover cidadania e dignidade para refugiados por meio de apoio jurídico e profissional.",
            "site": "https://www.refugiosolidario.org"
        },
        {
            "id": 2,
            "nome": "Mão Amiga",
            "localizacao": "Rio de Janeiro, RJ",
            "servicos": "Aulas de português, apoio psicológico, ajuda na integração social",
            "contato": "contato@maoamiga.org",
            "descricao": "ONG focada na inclusão social de migrantes e refugiados, oferecendo aulas de idioma, suporte emocional e atividades comunitárias.",
            "setor": "Educação e Integração Social",
            "compromisso": "Garantir que migrantes e refugiados tenham acesso à linguagem, saúde emocional e pertencimento comunitário.",
            "site": "https://www.maoamiga.org"
        },
        {
            "id": 3,
            "nome": "Casa do Migrante",
            "localizacao": "Belo Horizonte, MG",
            "servicos": "Alojamento temporário, orientação sobre direitos trabalhistas, oficinas culturais",
            "contato": "contato@casadomigrante.org",
            "descricao": "Espaço de acolhimento para migrantes em situação de vulnerabilidade, promovendo acolhida humanizada e acesso a serviços essenciais.",
            "setor": "Acolhimento e Direitos Trabalhistas",
            "compromisso": "Oferecer abrigo seguro e suporte legal, valorizando a cultura e os direitos dos migrantes.",
            "site": "https://www.casadomigrante.org"
        },
        {
            "id": 4,
            "nome": "Caminhos da Esperança",
            "localizacao": "Fortaleza, CE",
            "servicos": "Apoio na busca por emprego, capacitação profissional e assistência social",
            "contato": "contato@caminhosdaesperanca.org",
            "descricao": "Instituição dedicada a fortalecer a autonomia de refugiados e migrantes, facilitando sua inserção no mercado formal e na comunidade local.",
            "setor": "Empregabilidade e Desenvolvimento Social",
            "compromisso": "Capacitar e inserir refugiados e migrantes no mercado de trabalho de forma digna e sustentável.",
            "site": "https://www.caminhosdaesperanca.org"
        }
    ],
    "programas": [
        {
            "id": 1,
            "nome": "Horta Comunitária \"Cultivando Pontes\"",
            "local": "Presencial",
            "tipo": "Curso",
            "descricao": "Projeto de horta urbana onde refugiados, imigrantes e moradores locais cultivam alimentos juntos.",
            "oferecidoPor": 5
        },
        {
            "id": 2,
            "nome": "Capacitação Profissional para Refugiados",
            "local": "Online",
            "tipo": "Curso",
            "descricao": "Capacitação técnica para áreas com alta demanda, como tecnologia e logística.",
            "oferecidoPor": 1
        },
        {
            "id": 3,
            "nome": "Português para Todos",
            "local": "Presencial",
            "tipo": "Aula",
            "descricao": "Curso intensivo de português para migrantes com material didático gratuito.",
            "oferecidoPor": 2
        },
        {
            "id": 4,
            "nome": "Oficinas de Direitos Trabalhistas",
            "local": "Presencial",
            "tipo": "Palestra e Atendimento",
            "descricao": "Explicações práticas sobre direitos e deveres trabalhistas no Brasil.",
            "oferecidoPor": 3
        },
        {
            "id": 5,
            "nome": "Conectando Caminhos",
            "local": "Online e Presencial",
            "tipo": "Mentoria",
            "descricao": "Mentorias com profissionais voluntários para ajudar na inserção no mercado.",
            "oferecidoPor": 4
        }
    ]
}